package days03;

/**
 * @author 조은주
 * @date 2021. 3. 10 - 오후 4:46:07
 * @subject 3일-10번: 단항 연산자
 * @content 87쪽 관련
 *
 */
public class Ex10 {

	public static void main(String[] args) {

		//		## 단항 연산자
		//
		//		++ -- + - ~ ! (type) \[\] .
		//
		//		### [] 인덱스index 연산자 ★★★★★
		//
		//		String[] args에 있던 것 //String[] 배열(배열명 args)이 매개변수
		//
		//		한 학생의 국어점수를 저장할 변수를 선언하세요.  
		int kor;
		//
		//		세 학생의 국어점수를 저장할 변수를 선언하세요.  
		int kor1, kor2, kor3;
		//
		//		5만명 학생의 국어점수를 저장할 변수를 선언하세요.  
		//			int kor1, ko2, ... ,kor50000;
		//
		//
		//		#### 배열array
		//
		//		배열을 182쪽.. 담에 일주일정도 배움 엄청 중요함  
		//		▶배열의 정의: 동일한 자료형 + 메모리상에 연속적으로 놓이게 한 것  
		//		▶배열 선언 형식: 자료형 [] 배열명;(변수명이라고 해도됨(더 포괄적))  
		//		(자료형 배열명[]도 가능하나 일단 위에 것 자주 쓰니 기억)
		//
		//		int [] kors; 
		//		kors = 배열명  
		//		kors = new int[5(=배열크기)];
		//
		//		배열명[첨자값]  
		//		kors[0] = 첫번째 자리. 0:첨자(index값). 기억공간 주소 지명
		//
		//		▶heap 영역 = 동적 메모리 영역(실제 기억 공간 할당)  
		//		▶stack 영역 = 힙영역에서 주소값을 참조해 옴

		//		# 표 91쪽 연산순서
	}

}
