package days04;

/**
 * @author 조은주
 * @date 2021. 3. 11 - 오후 3:19:39
 * @subject 4일-8번 : 조건식 && 세울수 있어야함
 * @content
 *
 */
public class Ex08 {

	public static void main(String[] args) {

// 114쪽
//  1.x는 10보다 크고, 20보다 작다(둘 다 만족)
//  x > 10  &&  x < 20
//
// 2. i는 2의 배수 또는 3의 배수이다.
//  배수표현? ->   i % n == 0 (n의 배수)
//  i % 2 ==0  ||  i %3 ==0
//
//  3. i는 2의 배수 또는 3의 배수이지만 6의 배수는 아니다.
//   i % 2 == 0  ||  i % 3 ==0  &&  i %6!=0 
//
//  4. 문자 ch는 숫자('0'~'9') 이다.
// String [] ch = {0 ~9};??
//
// 		ch >=48 && ch<=57
// 		ch >='0' && ch<='9'
// 둘 다 가능함
//
//  5. 문자 ch는 대문자 또는 소문자이다 (답 116)

	}

}
